frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32F0xx/APM32F070.svd
                <register>
                    <name>BSC</name>
                    <displayName>BSC</displayName>
                    <description>GPIO port bit set/clear register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BC15</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC14</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC13</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC12</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC11</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC10</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC9</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC8</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC7</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC6</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC5</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC4</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC3</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC2</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC1</name>
                            <description>Port x clear bit y (y =
 0..15)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BC0</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS15</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS14</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS13</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS12</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS11</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS10</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS9</name>
                            <description>Port x set bit y ( y = 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS8</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS7</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS6</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS5</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS4</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS3</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS2</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS1</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS0</name>
                            <description>Port x set bit y (y = 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOCK</name>
                    <displayName>LOCK</displayName>
                    <description>GPIO port configuration lock
register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LOCKKEY</name>
                            <description>Port x lock bit y</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK15</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK14</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK13</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK12</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK11</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK10</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK9</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK8</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK7</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK6</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK5</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK4</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK3</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK2</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK1</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK0</name>
                            <description>Port x lock bit y (y = 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALFL</name>
                    <displayName>ALFL</displayName>
                    <description>GPIO alternate function low register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALFSEL7</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL6</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL5</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL4</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL3</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL2</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL1</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL0</name>
                            <description>Alternate function selection for port xbit y (y = 0..7)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALFH</name>
                    <displayName>ALFH</displayName>
                    <description>GPIO alternate function high register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALFSEL15</name>
                            <description>Alternate function selection for port xbit y (y = 8..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL14</name>
                            <description>Alternate function selection for port xbit y (y = 8..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL13</name>
                            <description>Alternate function selection for port xbit y (y = 8..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL12</name>
                            <description>Alternate function selection for port xbit y (y = 8..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL11</name>
                            <description>Alternate function selection for port xbit y (y = 8..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL10</name>
                            <description>Alternate function selection for port x
bit y (y = 8..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL9</name>
                            <description>Alternate function selection for port x
bit y (y = 8..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ALFSEL8</name>
                            <description>Alternate function selection for port x
bit y (y = 8..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
