frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32F0xx/APM32F070.svd
                <register>
                    <name>EP7</name>
                    <displayName>EP7</displayName>
                    <description>endpoint register 7 </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTFR</name>
                            <description>Correct Transfer Flag for Reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle for Reception Transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status Bits for Reception Transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup Transaction Completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint Type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint Kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer Flag for Transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle for Transmission Transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status Bits for Transmission Transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint Address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR0</name>
                    <displayName>TXADDR0</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT0</name>
                    <displayName>TXCNT0</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x402</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR0</name>
                    <displayName>RXADDR0</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x404</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT0</name>
                    <displayName>RXCNT0</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x406</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR1</name>
                    <displayName>TXADDR1</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x408</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT1</name>
                    <displayName>TXCNT1</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x40A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR1</name>
                    <displayName>RXADDR1</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x40C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT1</name>
                    <displayName>RXCNT1</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x40E</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR2</name>
                    <displayName>TXADDR2</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x410</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT2</name>
                    <displayName>TXCNT2</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x412</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR2</name>
                    <displayName>RXADDR2</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x414</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT2</name>
                    <displayName>RXCNT2</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x416</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR3</name>
                    <displayName>TXADDR3</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x418</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT3</name>
                    <displayName>TXCNT3</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x41A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR3</name>
                    <displayName>RXADDR3</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x41C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT3</name>
                    <displayName>RXCNT3</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x41E</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR4</name>
                    <displayName>TXADDR4</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x420</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT4</name>
                    <displayName>TXCNT4</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x422</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR4</name>
                    <displayName>RXADDR4</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x424</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT4</name>
                    <displayName>RXCNT4</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x426</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR5</name>
                    <displayName>TXADDR5</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x428</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
