frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32F0xx/APM32F070.svd
                <register>
                    <name>TXCNT5</name>
                    <displayName>TXCNT5</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x42A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR5</name>
                    <displayName>RXADDR5</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x42C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT5</name>
                    <displayName>RXCNT5</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x42E</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR6</name>
                    <displayName>TXADDR6</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x430</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT6</name>
                    <displayName>TXCNT6</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x432</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR6</name>
                    <displayName>RXADDR6</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x434</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT6</name>
                    <displayName>RXCNT6</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x436</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXADDR7</name>
                    <displayName>TXADDR7</displayName>
                    <description>Transmission buffer address register 0</description>
                    <addressOffset>0x438</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Transmission Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCNT7</name>
                    <displayName>TXCNT7</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x43A</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transmission Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXADDR7</name>
                    <displayName>RXADDR7</displayName>
                    <description>Reception buffer address register 0</description>
                    <addressOffset>0x43C</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Reception Buffer Address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCNT7</name>
                    <displayName>RXCNT7</displayName>
                    <description>Transmission byte count register 0</description>
                    <addressOffset>0x43E</addressOffset>
                    <size>0x10</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Reception Byte Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLKNUM</name>
                            <description>Number of Blocks</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLKSIZE</name>
                            <description>Block Size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
